[
  {
    "path": "posts/2021-11-03-yes-but-what-is-a-gaussian-process-or-once-twice-three-times-a-definition-or-a-descent-into-madness/",
    "title": "Yes but what is a Gaussian process? or, Once, twice, three times a definition; or A descent into madness",
    "description": "Gaussian processes. As narrated by an increasingly deranged man during a day of torrential rain.",
    "author": [],
    "date": "2021-11-03",
    "categories": [],
    "contents": "\nI guess I’m going to talk about Gaussian processes now. This wasn’t the plan but who really expected a) there to be a plan or b) me to stick to the plan. I feel like writing about Gaussian processes and so I shall! It will be grand.\nWhat is a Gaussian process?\nWell I could tell you that a Gaussian process is defined by it’s joint distribution \\[\nu \\sim N(\\mu, \\Sigma),\n\\] where \\(u_i = u(s_i)\\), \\(\\mu_i = \\mu(s_i)\\) and \\(\\Sigma_{ij} = c(s_i, s_j)\\) for some positive definite covariance (or kernel) function \\(c(\\cdot, \\cdot)\\).\nBut that would be about as useful as presenting you with a dog that can bark “she’s a grand old flag”: perhaps good enough for a novelty hit, but there’s just no longevity in it.\nTo understand a Gaussian process you need to feel it deep down within you where the fear and the detailed mathematical concepts live.\nSo let’s try again.\nWe’re gonna have a … you know what. I’m not gonna do that. But I am going to define this stuff three times. Once for mum, once for dad, and once for the country.\nYou’ve got to wonder why anyone would introduce something three ways. There are some reasons. The first is, of course, that each definition gives you a different insight into different aspects of Gaussian processes (the operational, the boundless generality, the functional). And the second is because I’ve had to use all three of these ideas (and several more) over the years in order to understand how Gaussian processes work.\nI learnt about GPs from several sources (listed not in order):\nA Swede1 (so I will rant about random fields in the footnotes eventually);\nA book2 that was introducing GPs in a very general way because they needed the concept in outrageous generality to answer questions about the distribution of the maximum of a Gaussian process;\nA book3 written by a Russian who’s really only into measure theory and doesn’t believe anything is real if it isn’t at least happening on a Frechet space;\nAnd a book4 by a different Russian who’s really only into generalised Markov properties and needed to work with Gaussian processes that are defined over functions.\nOf these, the most relevant is probably the first one. I was primarily taught this stuff by Finn Lindgren, who had the misfortune of having the office next to mine when we worked together in Trondheim a very long time ago. (We both had a lot more hair then.)\nOne of the things that I learnt from him is that Gaussian processes can appear in all kinds of contexts, which means you need to understand them as a model for an unknown function rather than as a tool to be used in a specific context (like for Gaussian process regression or Gaussian process classification).\nIt’s some effort to really get a good grip on the whole “Gaussian processes as a model for an unknown function” thing but once you relax into it5, it stops being alarming to see models where you are observing things that aren’t just \\(u(s_k)\\). It is not alarming when you are observing integrals of the GP over regions, or derivatives. And you (or your methods) don’t fall apart when presented with complex non-linear functions on the GP (as happens if you look at\nBayesian inverse problems literature6).\nWhat is a Gaussian process? (Version 1)\nI’m going to start with the most common definition of a Gaussian process7. This is the definition that was alluded to in the first section and it’s also the definition operationalised in book’s like Rasmussen and Williams8, which is a bread and butter reference for most machine learners interested in GPs, use.\nThe idea is pretty straightforward: I need to define a stochastic model for an unknown function \\(u(s)\\) and I want it to be, in some sense, Gaussian. So how do I go about doing this?\nFirstly, I probably don’t care too much about the function as an abstract object. For example, if I’m using the Gaussian process to model something like temperature, I am only going to observe it at a fairly small number of places (even though I could choose any set of places I want). This means that for some arbitrary set set of \\(K\\) locations \\(s_1, s_2, \\ldots, s_K\\), I am most interested9 in understanding the joint distribution10\\[\n(u(s_1), \\dots, u(s_K))^T. \n\\]\nSo how would we model the joint distribution? If we want the model to be tractable, we probably want a nice distribution. This is where the Gaussian part comes in. The Gaussian distribution is an extremely tractable11 distributions in medium-to-high dimensions. So the choice to model our joint distribution (which could be any size \\(K\\)) as \\[\n(u(s_1), \\dots, u(s_K))^T \\sim N\\left(\\mu_{s_1, \\ldots, s_K}, \\Sigma_{s_1, \\ldots, s_K}\\right),\n\\] makes sense from a purely mercenary position12.\nSo how do we choose the mean and the covariance function? We will see that the mean can be selected as \\([\\mu_{s_1, \\ldots, s_K}]_{k} = \\mu(s_k)\\) for pretty much any function13 \\(\\mu(\\cdot)\\), but, when we come to write \\[\n[\\Sigma_{s_1, \\ldots, s_K}]_{ij} = c(s_i, s_j),\n\\] there will be some very strong restrictions on the covariance function \\(c(\\cdot, \\cdot)\\).\nSo where do these restrictions come from?\nOh those (gay) Russians!\nAs with all things in probability, all the good shit comes from the Soviets. Kolmogorov14 was a leading light in the Soviet push to formalise probability and one of his many many many contributions is something called the Kolmogorov extension theorem, which gives the exact conditions under which we can go from declaring that the distributions of $(u(s_1), , u(s_K))^T (these are called finite dimensional distributions) are Gaussian to describing a legitimate random function \\(u(s)\\).\nThere are essentially two conditions:\nThe order of the observations doesn’t matter in a material way. In our case changing the order just permutes the rows and columns of the mean vector and covariance matrix, which is perfectly ok.\nThere is a consistent way to map between the distributions of \\((u(s_1), \\ldots, u(s_K), u(s_{K+1}))^T\\) and \\((u(s_1), \\ldots, u(s_K))^T\\). This is the condition that puts a strong restriction on the covariance function.\nEssentially, we need to make sure that we have a consistent way to add rows and columns to our covariance matrix while ensuring that stays positive definite (that is, while all of the eigenvalues stay non-negative, which is the condition required for a multivariate normal distribution15). The condition—which is really gross—is that for every positive integer \\(K\\) and every set of points \\(s_1, \\ldots, s_k\\), and for every \\(a_1, \\ldots, a_K\\) not all equal to zero, we require that \\[\n\\sum_{i=1}^K \\sum_{j = 1}^K a_ia_j c(s_i, s_j) \\geq 0.\n\\]\nThis condition is obviously very difficult to check. This is why people typically choose their covariance function from a very short list16 that is typically found in a book on Gaussian processes.\nBut Kolmogorov said a little bit more\nThere’s a weird thing in grad school in north america where they insist on teaching measure theoretic probability theory and then never ever ever ever ever using any of the subtleties. But Gaussian processes (and, in general, stochastic processes on uncountable index spaces) are a great example of when you need these details.\nWhy? Because unlike discrete probability (where the set of events that we can compute the probability of is obvious) or even continuous random variables (where the events that we can’t compute the probability of are so weird we can truly just ignore them unless we are doing something truly exotic), for Gaussian processes,17 the set of allowable events is considerably smaller than the set of all things you might want probabilities of.\nThe gist of it is that we have built up a random function \\(u(s)\\) from a bunch of finite random vectors. This means that we can only assign probabilities to events that can be built up from events on finite random vectors. The resulting set of events (or \\(\\sigma\\)-algebra to use the adult term) is called the cylindrical18 \\(\\sigma\\)-algebra and can be roughly19 thought of as the set of all events that can be evaluated by evaluating \\(u(\\cdot)\\) at most a countable number of times.\nThings that aren’t measurable\nThis will potentially become a problem if, for instance, you are working with a Gaussian process in a model that uses a Gaussian process in a weird way. When this happens, it is not guaranteed that, for instance, your likelihood is a measurable function, which would mean that you can’t normalise your probability distribution! (I mean, don’t worry. Unless you’re doing something fairly wild it will be, but it has come up especially in the inverse problems literature!)\nThis limited set of measurable events even seems to preclude well studied “events” like “\\(u\\) is continuous” or “\\(u\\) is twice continuously differentiable” or “\\(u\\) has a finite supremum”. All things that we a) want to know about a Gaussian process and b) things people frequently say about Gaussian processes. It is common for people to say that “Brownian motion is continuous” and similar things.\nAs with all of mathematics, there are a lot of work arounds that we can use. For those three statements in particular, there is some really elegant mathematical work (due, again, to Kolmogorov and extended greatly by others). The idea is that we can build another function \\(\\tilde u(s)\\) such that \\(\\Pr(u(s) = \\tilde u(s)) = 1\\) for all20 \\(s\\) such that \\(\\tilde u(s)\\) is continuous (or differentiable or bounded).\nIn the language of stochastic processes, \\(\\tilde u(s)\\) is called a version of \\(u(s)\\) and the more correct, temperate language (aka the one least likely to find in the literature) is that \\(u(s)\\) has a continuous/differentiable/bounded version.\nIf you’re interested in seeing how a differentiable version of a Gaussian process is constructed, you basically have to dick around with dyads for a while. Martin Hairer’s lecture notes21 is a nice clear example.\nWhere are the limitations of this definition?\nThere are a few. These are, of course, in the eye of the beer holder. The definition is workable in a lot of situations and, with some explanation can be broadened out a bit more. It’s less of a great definition when you’re trying to manipulate Gaussian processes as mathematical objects, but that’s what the next one is for.\nThe first limitation is maybe not so much a limit of the definition as a bit of work you have to do to make it applicable. And that is: what happens if I am observing (or my likelihood depends on) averages like \\[\n\\left(\\int_S \\ell_1(s) u(s)\\,ds, \\ldots, \\int_S \\ell_K(s) u(s)\\,ds\\right)^T\n\\] instead of simple point evaluations22.\nThis might seem like a massively different problem, until we remember that integrals are just sums dressed up for Halloween, so we can approximate the integrals arbitrarily well by sums23. In fact, if we squint24 a bit, we can see that the above vector will also be multivariate Gaussian with mean vector \\[\n[\\mu]_k = \\int_S \\ell_k(s) \\mu(s)\\,ds\n\\] and covariance matrix with entries \\[\n[\\Sigma]_{ij} = \\int_{S \\times S} \\ell_i(s) \\ell_j(s')c(s, s')\\,dsds'.\n\\] Similar formulas hold for derivative observations.\nProbably the bigger limitation is that in this way of seeing things, your view is tied very tightly to the covariance function. While it is a natural object for defining Gaussian processes, it is fucking inconvenient if you want to understand things like how well approximate Gaussian processes work.\nAnd let’s face it, a big chunk of Gaussian processes we see in practice are approximate because the computational burden on large data sets is too big to do anything but approximate.\n(Fun fact, when I was much much younger I wrote a paper that was a better title than a paper25 called26 In order to make spatial statistics computationally feasible, we need to abandon the covariance function. I copped a lot of shit for it at the time [partly because the title was better than the paper, but partly because some people are dicks], but I think the subsequent 10 years largely proved me (or at least my title) right27.)\nThe focus on the covariance function also hides the strong similarity between Gaussian process literature and the smoothing splines literature starting from Grace Wahba in the 1970s. It’s not that nobody notices this, but it’s work to get there!\nIn a similar way, it hides the fundamental role the reproducing kernel Hilbert space (or Cameron-Martin space) is doing and the ways that Gaussian process regression is (and is not) like kernel smoothing in RKHSs. This, again, isn’t a secret per se—you can find this information if you want it—but it’s confusing to people and the lack of clarity leads to people missing useful connections (or sometimes leads to them drawing mistaken parallels).\nHow many times have you seen someone say that realisations of a Gaussian process are in the RKHS associated with the covariance function? They are not. In fact, every realisation of a Gaussian process is rougher than any function in the RKHS (with probability 1)! Unfortunately, this means that your reason for choosing the kernel in a RKHS regression and for choosing the covariance function in a Gaussian process prior need to be subtly different. Or, to put it differently, a penalty is not a log-prior and interpreting the maximum a penalised likelihood is, in high dimensions, a very distant activity from interpreting a posterior distribution (even when the penalty is the log of the prior).\nWhat is a Gaussian process? (Version 2)\nOk. Let’s do this again. This definition lives in a considerably more mathematical space and while I’m gonna try to explain the key terms, I will fail. But hey. Who doesn’t like googling weird terms?\nA Gaussian process is a collection of random variables \\(u(s)\\), where \\(s \\in S\\) and \\(S\\) is some set of things that isn’t too topologically disastrous28.\nBut what makes it Gaussian? Here’s the general definition.\n\nA stochastic process/random field is Gaussian if and only if every continuous linear functional has a univariate Gaussian distribution.\n\nWell that’s very useful Daniel. What the hell is a linear functional?\nGreat question angry man who lives inside my head! It is any function \\(\\ell(\\cdot)\\) that takes the Gaussian process \\(u(s)\\) and an input and spits out a real number that is is\nLinear. Aka \\(\\alpha \\ell(u) + \\beta\\ell(v) = \\ell(\\alpha u + \\beta v)\\)\nBounded29.\nGreat. Love a definition. Shall we try something more concrete?\nPoint evaluation \\(u(s_j)\\) (aka evaluating the function at a point) is a linear functional (\\((u + v)(s)_j = u(s_j) + v(s_j)\\)). As is a definite integral over a set \\(\\int_A u(s)\\,ds\\).\nIt’s a fun little exercise to convince yourself that this all implies that for any collection \\(\\ell_1(\\cdot), \\ldots, \\ell_J(\\cdot)\\) of continuous linear functionals, then \\(u(s)\\) is a Gaussian process means that the vector \\[\n(\\ell_1(u), \\ldots \\ell_J(u))^T\n\\] is multivariate Gaussian.\nYour idea of fun is not my idea of fun. Anyway. Keep talking.\nIf \\(u\\) lives in a Banach space30 \\(B\\), then the set of all continuous/bounded linear functionals on \\(B\\) is called the dual space and is denoted \\(B^*\\).         \nI mean, cool I guess but where the merry hell is the covariance function\nIn this context, the most important thing about \\(B^*\\) is it does double duty: it is both a space of linear functionals and a space that can be identified with random variables.\nHow the fuck do you do that?\nWell, the trick is to remember the definition! If \\(\\ell \\in B^*\\), then \\(\\ell(u)\\) is a Gaussian. Similarly, if we have two functionals \\(\\ell, \\ell' \\in B^*\\) we consider the covariance of their associated random variables \\[\nC_u(\\ell, \\ell') = \\mathbb{E}(\\ell(u)\\ell'(u)).\n\\]\n\\(C_u(\\ell, \\ell')\\) is a symmetric, positive definite bilinear form (aka good candidate for an inner product)!\nWe can use this to add more functions to \\(B^*\\), particularly for any sequence \\(b_n \\in B^*\\) that is Cauchy with respect to the norm \\(\\|\\ell\\|_{R_u} = \\sqrt{C_u(\\ell, \\ell)}\\) we append the limit to \\(B^*\\) to complete the space. Once we take equivalence classes, we end up with a Hilbert space \\(R_u\\) that, very unfortunately, probabilists have a tendency to call the reproducing kernel Hilbert space associated with \\(u\\).\nWhy is this unfortunate? Well primarily because it’s not the exact same space that machine learners call the reproducing kernel Hilbert space, which is, to put it mildly, confusing. But we can build the machine learner’s RKHS (known to probabilists as the Cameron-Martin space).\nWhy are you even telling me this? Is this a digression?\nHonestly. Yes. But regardless the space \\(R_u\\) is quite useful to understand what’s going on. To start off, let’s do one example that shows just how different a Gaussian process is from a multivariate normal random vector. We will show that if we multiply a GP by a constant, we completely change its support31! Many a computational and inferential ship have come to grief on these sharp rocks.\nTo do this, though, we need32 to make an assumption on \\(B\\): We assume that \\(B\\) is separable33. This isn’t an vacuous assumption, but in a lot of cases of practical interest, this is basically the same thing as assuming the set \\(S\\) is a nice bounded domain or a friendly compact manifold (and not something like \\(\\mathbb{R}^d\\))34.\nSo. How do we use \\(R_u\\) to show that Gaussian processes are evil? Well we begin by noting that \\(R_u\\) is a separable35 Hilbert space it contains an orthonormal basis \\(e_n\\), \\(n=1, \\ldots, \\infty\\) (that is \\(\\|e_n\\|_{R_u} = 1\\) and \\(\\langle e_n, e_m\\rangle_{R_u} = 0\\) if \\(n\\neq m\\)). We can use this basis to show some really really weird stuff about \\(u(s)\\).\nIn particular, consider another Gaussian process \\(v(s) = c u(s)\\), where \\(c\\) is a non-zero constant. For this process we can build \\(R_v\\) in an analogous way. The \\(e_n\\) are still orthogonal in \\(R_v\\) but now \\(\\|e_n\\|_{R_v} = c^2\\).\nNow consider the functional \\(X_K(\\cdot) = K^{-1}\\sum_{k = 1}^Ke_i(\\cdot)^2\\). We are going to use this function to break stuff! To do this, we are going to define two disjoint sets of functions \\(A_1 = \\{u: \\lim_{K\\rightarrow \\infty} X_K(u) = 1\\}\\) and \\(A_2 = \\{u: \\lim_{K\\rightarrow \\infty} X_K(u) = c^2\\}\\). Clearly \\(A_1\\) and \\(A_2\\) are disjoint if \\(|c|\\neq 1\\).\nBecause \\(e_n(\\cdot)\\) are orthonormal in \\(R_u\\), it follows that that \\(u_n = e_n(u) \\sim N(0,1)\\) are iid. Similarly, \\(v_n = e_n(v) \\sim N(0, c^2)\\) are also independent. Hence it follows from the properties of \\(\\chi^2\\) random variables (aka the mean plus the strong law of large numbers) that \\(X_K(u) \\rightarrow 1\\) and hence \\(\\Pr(u \\in A_1) = 1\\). On the other hand, \\(X_K(v) \\rightarrow c^2\\), so \\(\\Pr(v \\in A_2) = 1\\). As \\(A_1\\) and \\(A_2\\) are disjoint, this means that unless \\(|c|=1\\), the processes \\(u\\) and \\(v\\) are mutually singular (aka they have no overlapping support).\nWhat does this mean? This means the distributions of \\(u\\) and \\(v\\) (which remember is just \\(u\\) multiplied by a constant) are as different from each other as a normal distribution truncated to \\((-\\infty, 1)\\) and another normal distribution truncated to \\((1, \\infty)\\)! Or, more realistically36, as disjoint as a distribution over \\(2\\mathbb{Z}\\) and \\((2\\mathbb{Z} - 1)\\).\nThis is an example of the most annoying phenomena in Gaussian processes37: the slightest change in a Gaussian process can lead to a mutually singular process. In fact, this is not a particularly strange example. It can be shown that Gaussian processes over uncountable index spaces are either absolutely continuous or mutually singular. There is no half-arsing it!\nThis has a lot of implications when it comes to computing38, setting priors on the parameters that control the properties of the covariance function39, and just generally inference40.\nYes but where’s our reproducing kernel Hilbert space\nWe just saw that if \\(u\\) is a Gaussian process than \\(c u\\) will be a singular GP if \\(|c| \\neq 1\\). What happens if we add things? Well, a result known as the Cameron-Martin theorem says that, for a deterministic \\(h(s) \\in B\\), \\(u(s) + h(s)\\) is absolutely continuous wrt \\(u(s)\\) if and only if \\(h(s)\\) is in the Cameron-Martin space \\(H_u\\) (this is the one that machine learners call the RKHS!).\nBut how do we find this mythical space? I find this quite stressful!\nLike, honey I do not know. But when a probabilist is in distress, we can calm them by screaming characteristic function at the top of our lungs right into their ear. Try it. It definitely works. You won’t be arrested.\nSo let’s do that. The characteristic function of a univariate random variable \\(X\\) is \\[\n\\phi_X(t) = \\mathbb{E}\\left(e^{itX}\\right),\n\\] which doesn’t seem like it’s going to be an amazingly useful thing, but it actually is. It’s how you prove the central limit theorem41, and a few other shiny things.\nWhen we are dealing with more complex random things, like random vectors and Gaussian processes, we can use characteristic functions, but we need to extend beyond the fact that they’re currently only defined for univariate random variables. Conveniently, we have some lying around. In particular, if \\(\\ell \\in B^*\\), we have the associated random variable \\(\\ell(u)\\) and we can compute its characteristic function42, which leads to the definition of a characteristic function of a stochastic process on \\(B\\) \\[\n\\phi_u(\\ell) = \\mathbb{E}(e^{i\\ell(u)}), \\quad \\ell \\in B^*.\n\\]\nNow this feels quite different. It’s no longer a function of some real number \\(t\\) but is instead a function of a linear functional \\(\\ell\\), which feels weird but isn’t.\nCharacteristic functions are immensely useful because if two Gaussian processes have same characteristic function they have the same distribution43.\nBecause \\(u(s)\\) is a Gaussian process, we can compute its characteristic function! We know that \\(\\ell(u)\\) is Gaussian so we can look up its characteristic function on Wikipedia and get that \\[\n\\mathbb{E}(e^{i\\ell(u)}) = \\exp\\left[{i \\mu(\\ell) - \\frac{\\sigma^2(\\ell)}{2}}\\right],\n\\] where \\(\\mu(\\ell) = \\mathbb{E}(\\ell(u))\\) and \\(\\sigma^2(\\ell) = \\mathbb{E}(\\ell(u) - \\mu(\\ell))^2\\).\nWe know that \\[\n\\mu(\\ell) = \\mathbb{E}(\\ell(u))\n\\] and \\[\n\\sigma^2(\\ell) = \\mathbb{E}\\left[(\\ell(u) - \\mu(\\ell)^2\\right],\n\\] the latter of which can be extended naturally to the aforementioned positive definite quadratic form \\[\nC_u(\\ell, \\ell') = \\mathbb{E}\\left[(\\ell(u) - \\mu(\\ell)(\\ell'(u) - \\mu(\\ell'))\\right], \\quad \\ell, \\ell' \\in B^*.\n\\]\nThis leads to the exact form of the characteristic function and to this theorem, which is true.\n\nTheorem: A stochastic process \\(u(\\cdot)\\) is a Gaussian process if and only if \\[\n\\phi_u(\\ell) = \\exp\\left[i\\mu(\\ell) - \\frac{1}{2}C_u(\\ell, \\ell)\\right].\n\\]\n\nSo Alf is back. In pog form.\nYes.\nIn this case, we can define the covariance operator \\(C_u: B^* \\rightarrow B\\) as44 \\[\n(C_u \\ell) (\\ell') = \\mathbb{E}\\left[(\\ell(u) - \\mu(\\ell)(\\ell'(u) - \\mu(\\ell'))\\right].\n\\] The definition is cleaner when \\(\\mu(\\ell) = 0\\) (which is why people tend to assume that when writing this shit down45), in which case we get \\[\nC_u\\ell = \\mathbb{E}(u\\ell(u)) \n\\] and \\[\nC_u(\\ell, \\ell') = \\ell'(C_u\\ell)\n\\]\nGreat gowns, beautiful gowns.\nWow. Shady.\nAnyway, the whole reason to introduce this is the following:\n\nTheorem: Let \\(v = x + h\\). Then \\[\n\\phi_v(\\ell) = e^{i\\ell(h)}\\phi_u(\\ell)\n\\]\n\nThis does not not help us answer the question of whether or not \\(v\\) has the same support as \\(u\\). To do this, we construct a variable that is absolutely continuous with respect to \\(u\\) (we guarantee this because we specify its density46 wrt \\(u\\)).\nTo this end, take some \\(g \\in R_u\\) and define a stochastic process \\(w\\) with density wrt47 u \\[\n\\rho(u) = \\exp\\left[iC_u(g, u) - \\frac{1}{2}C_u(g,g)\\right].\n\\]\nFrom this, we can compute48 the characteristic function of \\(w\\) \\[\\begin{align*}\n\\phi_w(\\ell) &= \\mathbb{E}_w\\left(e^{i\\ell(w)}\\right) \\\\\n&= \\mathbb{E}_u\\left(\\rho(u) e^{i\\ell(u)}\\right) \\\\\n&= \\exp\\left[iC_u(g,\\ell) + i \\mu(\\ell)  - \\frac{1}{2}C_u(\\ell, \\ell)\\right]\n\\end{align*}\\]\nSo we are fine if we can find some \\(h \\in B\\) such that \\[\nC_u(g, \\ell) = \\ell(h).\n\\] To do this, we note that \\[\nC_u(g, \\ell) = \\ell(C_u g), \n\\] so for any \\(g\\) we can find a \\(h \\in B\\) such that \\(h = C_ug\\) and for such a \\(h\\) \\(v(s) = u(s) + h(s)\\) is absolutely continuous with respect to \\(u(s)\\).\nThis gives us our definition of the Cameron-Martin space (aka the RKHS) associated with \\(u\\).\n\nDefinition:  The Cameron-Martin space (or reproducing kernel Hilbert space, if you must) associated with a Gaussian process \\(u\\) is the Hilbert space \\(H_u = \\{h\\in B: h = C_uh^* \\text{ for some } h^* \\in R_u\\}\\) equipped with the inner product \\[\n\\langle h, h'\\rangle_{H_u} = C_u(h^*, (h')^*)\n\\]\n\nLord in heaven. Any chance of being a bit more concrete?\nSure! Let’s consider the case where \\(u \\in \\mathbb{R}^n\\) is a Gaussian random vector \\[\nu \\sim N(\\mu, \\Sigma).\n\\] While all of this is horribly over-powered for this case, it does help get a grip on what the inner product on \\(H_u\\) is.\nIn this case, \\(B^*\\) is row vectors like \\(f^T\\), \\(f\\in \\mathbb{R}^n\\) and \\[\nC_u(f^T, g^T) = \\operatorname{Cov}(f^Tu, g^Tu) = f^T\\Sigma g.\n\\]\nFurthermore,     the operator \\(C_u = \\Sigma f\\) satisfies \\(g^T(\\Sigma f) = C_u(f^T,g^T)\\).\nSo what is \\(H_u\\)? Well, every \\(n\\) dimensional vector space can be represented as an \\(n\\)-dimensional vector, so what we really need to do is identify \\(h^*\\) from \\(h\\). To do this, we use the relationship \\(C(h^*, \\ell) = \\ell(h)\\) for all \\(\\ell \\in B^*\\). Translating that to our finite dimensional case we get that \\[\n(h^*)^T\\Sigma g = h^T g,\\qquad g \\in \\mathbb{R}^n,\n\\] from which it follows that \\(h^* = \\Sigma^{-1}h\\). Hence we get the inner product between \\(h, k \\in H_u\\) \\[\\begin{align*}\n\\langle h, k\\rangle_{H_u} &= \\langle h^*, k^*\\rangle_{R_h} \\\\\n&= (\\Sigma^{-1} h)^T \\Sigma (\\Sigma^{-1 k}) \\\\\n&= h^T \\Sigma^{-1} k.\n\\end{align*}\\]\nOk! That’s cool!\nYes! And the same thing holds in general, if you squint49. Just replace the covariance matrix \\(\\Sigma\\) with the covariance operator \\[\n(\\mathcal{C}f)(s) = \\int_S c(s, s') f(s') \\, ds'.\n\\]\nThis operator has (in a suitable sense) a symmetric50 non-negative definite (left) (closed) inverse operator \\(\\mathcal{Q}\\), which defines the RKHS inner product by \\[\n\\langle f, g \\rangle_{H_u} = \\int_{S} f(s) (\\mathcal{Q} g)(s) \\,ds,\n\\] where \\(f\\) and \\(g\\) are smooth enough functions for this to make sense. In general, \\(\\mathcal{Q}\\) will be a (very) singular integral operator, but when \\(u(s)\\) has the Markov property, \\(\\mathcal{Q}\\) is a differential operator. In all of these cases the RKHS is the set of functions that are smooth enough that \\(\\langle f, f \\rangle_{H_u} < \\infty\\).\nWe sometimes call the operator \\(\\mathcal{Q}\\) the precision operator and it’s fundamental to thin plate spline theory as well as some nice ways to approximate GPs in 1-4 dimensions. I will blog about this later, probably, but for now if you’re interested Finn Lindgren, Håvard Rue, and David Bolin just released a really nice survey paper about the technique.\nTell me some things about the Cameron-Martin space\nNow that we’ve gone to the effort of finding it, I should probably tell you why it’s so important. So here are a collection of facts!\nFact 1: The Cameron-Martin space (the set of functions and the inner product) determines a51 Gaussian process, in that if two Gaussian processes have the same mean and the the same Cameron-Martin space, they have the same distribution. In fact, the next definition of a Gaussian process is going to show this constructively.\nThis is nice because it means you can define a Gaussian process without needing to specify its covariance function. You just (just!) need to specify a Hilbert space. It turns out that this is a considerably easier task than trying to find a positive definite covariance function if the domain \\(S\\) is weird.\nFact 2: \\(u(s)\\) is never in the RKHS. That is, \\(\\Pr(u \\in H_u) = 0\\). But52 if, for any \\(\\epsilon>0\\), \\(A_\\epsilon \\subset B\\) is any measurable set of functions with \\(\\Pr(u \\in A) = \\epsilon\\), then \\(\\Pr(u \\in A_\\epsilon + H_u) = 1\\), where \\(A_\\epsilon+H_u = \\{a + h \\in B: a\\in A_\\epsilon, h \\in H_u\\}\\). Or to say it in words, although \\(u\\) is never in \\(H_u\\), if you find a set \\(A_\\epsilon\\) that \\(u\\) could be in (even if it’s extremely unlikely to be there), then \\(u\\) is almost surely made up of a function in \\(A_\\epsilon\\) plus a function in \\(H_u\\).\nThis is wild. It means that while \\(u(\\cdot)\\) is never in the RKHS, all you need to do is add a bit of rough to get all of the stuff out. Another characterisation of the RKHS that are related to this is that it is the intersection of all subsets of \\(B\\) that have full measure under \\(u\\) (aka all sets \\(A\\subset B\\) such that \\(\\Pr(u \\in A) = 1\\)).\nFact 3: If we observe some data \\(y = N(Tu, \\Sigma_y)\\), where \\(Tu = (\\ell_1(u),\\ldots, \\ell_n(u))^T\\) is some observation vector, then the posterior mean \\(\\mathbb{E}(u \\mid y)\\) is in the RKHS and that posterior distribution of \\(u\\mid y\\) is a Gaussian process that’s absolutely continuous with respect to the prior GP u(s). This means that the posterior mean, which is our best point prediction under squared error loss, is always smoother than any of the posterior draws.\nThis kinda makes sense: averaging things smooths out the rough edges. And so when we average a Gaussian process in this way, we make it smoother. But this is a thing that we need to be aware of! Our algorithms, our reasoning for choosing a kernel, and our interpretations of the posterior need to be aware that the space of posterior realizations \\(B\\) is rougher than the space that contains the posterior mean.\nFrequentists / people who penalise likelihoods don’t have to worry about this shit.\nSo what have we learnt?\nSo so so so so so so much notation and weird maths shit.\nBut there are three take aways here:\nThe importance of the Fourier transform (aka the characteristic function) when it comes to understanding Gaussian processes.\nThe maths buys us understanding of some of the more delicate properties of a Gaussian process as a random object (in particular it’s joint properties)\nYou can define a Gaussian process exclusively using the RKHS inner product. (You can also do all of the computations that way too, but we’ll cover that later). So you do not need to explicitly specify a covariance function. Grace Wahba started doing this with thin plate splines (and \\(L\\)-splines) in 1974 and it worked out pretty well for her.\nSo to finish off this post, let’s show one more way of constructing a Gaussian process. This time we will explicitly start from the RKHS.\nWhat is a Gaussian process? (Version 3)\nOur final Gaussian process definition is going to centre the RKHS53 as the fundamental object. This construction, which is known as an abstract Wiener space54 is less general55 than our previous definition, but it covers most of the processes we are going to encounter in applications.\nThis construction is by far the most abstract of the three (it is in the name after all). So buckle up.\nThe jumping off point here is a separable Hilbert space \\(H\\). This has an inner-product \\(\\langle\\cdot, \\cdot \\rangle_H\\) on it, and the associated notion of orthogonality and an orthogonal projector. Consider an \\(n\\)-dimensional subspace \\(V_n \\subset H_u\\). We can, without any trouble, define a Gaussian process on \\(V_n\\) \\(\\tilde u_n\\) with characteristic function \\[\n\\phi_{\\tilde u_n}(h) = \\exp\\left(-\\frac{1}{2}\\langle h,h\\rangle_H\\right).\n\\] We hit no mathematical problems because \\(V_n\\) is finite dimensional and nothing weird happens to Gaussians in finite dimensions.\nThe thing is, we can do this for any finite dimensional subspace \\(V_n\\) and, in particular, if we have a sequence of subspace \\(V_1 \\subset V_2 \\subset \\ldots\\), where \\(\\operatorname{dim}(V_n) =n\\), then we can build a sequence of finite dimensional Gaussian processes \\(\\tilde u_n\\) that are each supported in their respective \\(V_n\\).\nThe question is: can we construct a Gaussian process \\(\\tilde{u}\\) supported56 on \\(H\\) such that \\(P_n \\tilde u \\stackrel{d}{=} \\tilde u_n\\), where \\(P_n\\) is the orthogonal projector from \\(H\\) to \\(V_n\\)?\nYou would think the answer is yes. It is not. In fact, Komolgorov’s extension theorem says that we can build a Gaussian process this way, but it does not guarantee that the process will be supported on \\(H\\). And it is not.\nTo see why this is, we need to look a bit more carefully at the covariance operator of a Gaussian process on a separable Hilbert space. The key mathematical feature of a separable Hilbert space is that it has an57 orthonormal58 basis \\(e_n\\). We can use the orthonormal basis to do a tonne of things, but the one we need right now is the idea of a trace59 \\[\n\\operatorname{tr}(C_u) = \\sum_{n = 1}^\\infty C_u(e_i, e_i).\n\\]\nFor a (zero mean) Gaussian process \\(u\\) supported on \\(H\\), we can see that \\[\\begin{align*}\n\\operatorname{tr}(C_u) &= \\sum_{n = 1}^\\infty \\mathbb{E}\\left[(\\langle e_n, u\\rangle)^2\\right] \\\\\n&= \\mathbb{E}\\left[ \\sum_{n = 1}^\\infty\\langle e_n, u\\rangle_H^2\\right] \\\\\n&= \\mathbb{E}\\left[\\langle u, u\\rangle_H\\right] < \\infty,\n\\end{align*}\\] where the second line is just true because I say it is and the third line is Pythagoras’ theorem writ large (and is finite because Gaussian processes have a lot of moments60!).\nIf we were to say this in words, we would say that the covariance operator of a Gaussian process supported on a separable Hilbert space is a trace-class operator (or has a finite trace).\nAnd this is where we rejoin the main narrative. You see, if \\(\\tilde{u}\\) was a stochastic process on \\(H\\), then its characteristic function would be \\[\n\\phi_{\\tilde u}(h) = \\exp\\left(-\\frac{1}{2}\\langle h, h \\rangle_H\\right).\n\\] But it can’t be! Because \\(H\\) is infinite dimensional and the proposed covariance operator is the identity on \\(H\\), which is not trace class (its trace is clearly infinite).\nSo whatever \\(\\tilde u\\) is61, it is emphatically not a Gaussian process on \\(H\\).\nThat doesn’t seem like a very useful trip through abstract land\nWell, while we did not successful make a Gaussian process on \\(H\\) we did actually build the guts of a Gaussian process on a different space. The trick is to use the same idea in reverse. We showed that \\(\\tilde u\\) was not a Gaussian process because its covariance operator wasn’t on trace class. It turns out that the reverse also holds: if \\[\n\\phi_u(h) = \\exp\\left(-\\frac{1}{2}\\langle C_uh, h\\rangle_{H'}\\right)\n\\] and \\(C_u\\) is trace class on \\(H'\\), then \\(u\\) is a Gaussian process supported on \\(H'\\).\nThe hard part is going to be finding another Hilbert space \\(H' \\supset H\\).\nTo do this, we need to recall a definition of a separable Hilbert space \\(H\\) with orthonormal basis \\(e_n\\), \\(n=1, \\ldots, \\infty\\): \\[\nH = \\left\\{\\sum_{n=1}^\\infty a_n e_n: \\sum_{n=1}^\\infty a_n^2 < \\infty\\right\\}.\n\\] From this, we can build a larger separable Hilbert space \\(H'\\) as \\[\nH' = \\left\\{\\sum_{n=1}^\\infty a_n e_n: \\sum_{n=1}^\\infty \\frac{a_n^2}{n^2} < \\infty\\right\\}.\n\\] This is larger because there are sequences of \\(a_n\\)s that are admissible for \\(H'\\) that aren’t admissible for \\(H\\) (for example, \\(a_n = \\sqrt{n}\\)).\nWe let \\(j:H \\rightarrow H'\\) be the linear embedding that we get by considering an element \\(h \\in H\\) as an element of \\(H'\\). If we let \\(e_n'\\) be an orthonormal basis on \\(H'\\) (note: this is not the same as \\(e_n\\) as it needs to be re-scaled to have unit norm in \\(H'\\)), then we get \\[\nj\\left(\\sum_{n=1}^\\infty \\alpha_n e_n\\right) = \\sum_{n=1}^\\infty  \\frac{\\alpha_n}{n} e_n'.\n\\] Why? Because \\(\\|e_n\\|_{H'} = n^{-1}\\) which means that \\(e_n' = n e_n\\) is an orthonormal basis for \\(H'\\). This means we have to divide the coefficients by \\(n\\) when we move from \\(H\\) to \\(H'\\), otherwise we wouldn’t be representing the same function.\nWith this machinery set up, we can ask if \\(\\tilde u\\) is a Gaussian process on \\(H'\\). Or, more accurately, we can ask if \\(u = j(\\tilde u)\\) is a Gaussian process on \\(H\\).\nWell.\nLet’s compute its characteristic function. \\[\\begin{align*}\n\\phi_u(h') &= \\mathbb{E}\\left(e^{i\\left\\langle u, h' \\right\\rangle_{H'}}\\right) \\\\\n&= \\mathbb{E}\\left[\\exp\\left(i\\left\\langle \\sum_{n=1}^\\infty \\frac{\\langle \\tilde u, e_n\\rangle_H}{n}e_n', \\sum_{n=1}^\\infty h_n'e_n' \\right\\rangle_{H'}\\right) \\right] \\\\\n&= \\mathbb{E}\\left[\\exp\\left(i \\sum_{n=1}^\\infty \\frac{\\langle \\tilde u, e_n\\rangle}{n} h_n\\right) \\right] \\\\\n&= \\exp\\left(-\\frac{1}{2} \\sum_{n=1}^\\infty \\frac{h_n^2}{n^2}\\right).\n\\end{align*}\\] It follows that \\(\\phi_u(e_n') = e^{-1/(2n^2)}\\) and so62 \\[\n\\operatorname{tr}(C_u) = -2\\sum_{n=1}^\\infty \\log \\phi_u(e_n') = \\sum_{n=1}^\\infty \\frac{1}{n^2} < \\infty,\n\\] \\(C_u\\) is a trace class operator on \\(H'\\) and, therefore, \\(u\\) is a Gaussian process on \\(u\\).\nBut wait, there is more! To do the calculation above, we identified elements of \\(H'\\) as infinite sequences \\(h' = (h'_1, h'_2, \\ldots)\\) that satisfy \\(\\sum_{n=1}^\\infty n^{-2}h_n^2 < \\infty\\). In this case the covariance operator is \\(C_{u}\\) is diagonal, so the \\(n\\)th entry of \\(C_u h' = n^{-2}h'_n\\). From this, and the reasoning in the previous section, we see that the Cameron-Martin space can be thought of as a subset of \\(H'\\). The Cameron-Martin inner product can be constructed from the inverse of \\(C_u\\), which gives \\[\n\\langle a, b\\rangle_{H_u} = \\sum_{i=1}^\\infty n^2 a_n b_n.\n\\] Clearly, this will not be finite unless we put much much stronger restrictions on \\(a_n\\) and \\(b_n\\) than that \\(\\sum_{n\\geq 1} n^{-2}a_n^2 < \\infty\\).\nThe Cameron Marin space is the subspace of \\(H'\\) consisting of all functions \\(h' = \\sum_{n=1}^\\infty a_n e_n'\\) such that \\[\n \\sum_{n=1}^\\infty n^2a_n^2 < \\infty.\n\\] This is (isomorphic to) \\(H\\)!\nTo see this, we note that the condition is only going to hold if \\(a_n = n^{-1}\\alpha_n\\) for some sequence \\(\\alpha_n\\) such that \\(\\sum_{n\\geq 1} \\alpha_n^2 < \\infty\\). Remembering that \\(e_n' = n e_n\\), it follows that \\(h \\in H_u\\) if and only if \\[\\begin{align*}\nh &= \\sum_{n=1}^n\\frac{\\alpha_n}{n} e_n' \\\\\n&=\\sum_{n=1}^n\\frac{\\alpha_n}{n} n e_n \\\\\n&=\\sum_{n=1}^n \\alpha_n e_n,\n\\end{align*}\\] which is exactly the definition of \\(H\\).\nAre you actually trying to kill me?\nYes.\nSo let’s recap what we just did: We took a separable Hilbert space \\(H\\) and used it to construct a Gaussian process on a larger space \\(H'\\) with \\(H\\) as its Cameron-Martin space. And we did all of this without ever touching a covariance function. This is an abstract Wiener space construction of a Gaussian process.\nThe thing is that this construction is a lot more general than this. The following is a (simplified63) version of the abstract Wiener space theorem.\n\nTheorem: Let \\(H\\) be a separable Hilbert space and let \\(B\\) be a separable Banach space. Furthermore, we assume that \\(H\\) is dense in \\(B\\). Then there is a unique Gaussian process \\(u\\) with \\(\\Pr(u \\in B) = 1\\) and \\(H_u = H\\). It can be constructed from the canonical cylindrical Gaussian process \\(\\tilde u\\) on \\(H\\) by \\(u = j(\\tilde u)\\), where \\(j:H \\rightarrow E\\) is the natural embedding.\n\nWas there any point to doing that?\nI mean, probably not. The main thing we did here was see that you can take the RKHS as the primal object when building a Gaussian process. Why that may be a useful observation was not covered.\nWe also saw that there are some restrictions required on the covariance operator to ensure that a Gaussian process is a proper stochastic process on a given space. (For the tech-heads, the problem with \\(\\tilde u\\) is that it’s associated probability measure is not countably additive. That is a bad thing, so we do not allow it.)\nThe restrictions are very clear for covariance operators on separable Hilbert spaces (they must be trace class). Unfortunately, there isn’t any clean characterization of all allowable covariance operators on more complex spaces like Banach spaces64.\nWhere do we go now but nowhere\nAnd with that I have finished my task. I have defined Gaussian processes three different ways and if anyone is still reading at this point: you’re a fucking champion.\nI probably want to talk about other stuff eventually:\nUsing all this technology to work out what happens to a posterior when we approximate a Gaussian process (which we usually do for computational reasons)\nUnderstanding how singularity/absolute continuity of Gaussian measures can help you set priors for the parameters in a covariance function\nThe Markov property in space: what is it and how do you use it\nShow how we can use methods for solving PDEs to approximate Gaussian processes.\nThe last one has gotten a lot less urgent because Finn, David and Håvard just released a lovely survey paper.\nMaybe by the time I am finished with these things (if that ever happens, I don’t rate my chances), I will have justified all of this technicality. But for now, I am done.\n\nNot the root vegetable.↩︎\nThe first 5 chapters of Adler and Taylor’s masterpiece s are glorious↩︎\nNot gonna lie. Bogachev’s Gaussian Measures is only recommended if you believe in intercessory prayer.↩︎\nRozanov’s Markov Random Fields, which is freely available from that link and is so beautiful you will cry when it turns the whole question into one about function space embeddings. It will be a moist old time. Bring tissues.↩︎\nI recomend some video head cleaner↩︎\nwhich spent an embarrassing amount of time essentially divorced from the mainstream statistical literature↩︎\nThis is the nomenclature that machine learners thrust upon us and it’s annoying and I hate it. Traditionally, a stochastic process was indexed by time (so in this case it would be a one-dimensional Gaussian process and when it was indexed by any other set it was referred to as a random field. So I would much rather be talking about Gaussian random fields. Why? Because there’s a bunch of shit that is only true in 1D and I’m not interested in talking about that)↩︎\nGreat book. Great reference. No shade whatsoever↩︎\nMaybe? But maybe I’m most interested in the average temperature over a region. This is why we are going to need to think about things more general than just evaluating Gaussian processes at a location.↩︎\nWhy the joint? Well because it’s likely that nearby temperature measurements will be similar, while measurements that are far apart are more likely to be (almost) independent (maybe after adjusting for season, time of day, etc).↩︎\nin the sense that we have formulas for almost everything we want to have formulas for↩︎\nWe can also play games with multivariate Gaussians (like building deep Gaussian processes or putting stochastic models on the covariance structure) that markedly increase their flexibility.↩︎\nUsually this involves covariates!↩︎\nWikipedia edit war aside (have a gander, it’s a blast), there’s evidence that Kolmogorov had a long-term relationship with Aleksandrov that was a) known at the time and b) used by the Soviets to blackmail them. So that’s fun.↩︎\nto be proper on some subspace. We are allowed zero eigenvalues for technical reasons and it actually turns out to be useful later, making things like thin plate splines a type of Gaussian process. Grace Wahba had to do all this without Google.↩︎\nExponential, Mat'{e}rn, and squared-exponential are the common ones on \\(\\mathbb{R}^d\\). After that shit gets exotic.↩︎\nand any other process built from Kolmogorov’s extension theorem↩︎\nso named because a set \\(A = \\{u(\\cdot): u(s_1, \\ldots, u(s_K)) \\in B;\\; B\\in \\mathcal{B}(\\mathbb{R}^K)\\}\\) is called a cylinder set↩︎\nthe exact definition is the smallest \\(\\sigma\\)-algebra for which all continuous linear functionals are measurable↩︎\nThe all part is important here. Consider the function \\(u(s) = 1_{A}(s)\\) where \\(A\\) is uniformly distributed on \\(S\\) and \\(1_A(s)\\) is 1 when \\(s=A\\) and zero otherwise. This function is equal to \\(0\\) for almost every \\(s\\) (rather than for every \\(s\\)), but the random function \\(u(s)\\) is definitely not the zero function (it is always non-zero at exactly one point).↩︎\nBottom of page 12 through page 14 here↩︎\nThis is a straight generalisation. If \\(\\ell_k(s) = \\delta_{s_k}(s)\\) then it’s the exact situation we were in before.↩︎\nIn the technical language of the next section, the set of delta functions is dense in the space of bounded linear functionals↩︎\naka replace integrals with sums, compute the joint distribution of the sums, and then send everything to infinity, which is ok when \\(\\ell_k\\) are bounded↩︎\nThe paper is pretty good and I think it’s a nice contribution. But the title was perfect.↩︎\nSorry for the pay wall. It’s from so long ago it’s not on arXiv.↩︎\nYes. NN-GPs, Vecchia approximations, fixed-rank Kriging, variational GPs, and all of the methods I haven’t specifically done work on, all abandon some or all of the covariance function. Whether the people who work on those methods think they’re abandoning the covariance function is between them an Cher.↩︎\nI say this, but you can make this work over pretty bonkers spaces. If we want to be general, if \\(E\\) is a linear space and \\(F\\) is a space of functionals on \\(E\\) that separates the points of \\(F\\), then \\(u(s)\\) is defined as a Gaussian process (wrt the appropriate cylindrical \\(\\sigma\\)-algebra) if \\(f(u)\\) is Gaussian for all \\(f\\in F\\). Which is fairly general but also, like, at this point I am just really showing off my maths degree.↩︎\nIt is very convenient that continuous linear functionals and bounded linear functionals are the same thing.↩︎\nit’s the one with a norm↩︎\nThe support of \\(u\\) is a set \\(A \\subset B\\) such that \\(\\Pr(u \\in A) = 1\\).↩︎\nneed is a big word here. We don’t need to do this, but not doing it makes things more technical. The assumption we are about to make let’s us breeze past a lot of edge cases as we sail from the unfettered Chapter 2 of Bogachev to the more staid and calm Chapter 3 of Bogachev.↩︎\nThat it contains a countable dense set. Somewhat surprisingly, this implies that the Gaussian process is separable (or alternatively that it’s law is a Radon measure), which is a wildly technical condition that just makes everything about 80% less technical↩︎\nThere are separable spaces on the whole space too, but, like, leave me alone.↩︎\nI’ve made a↩︎\nThese sets don’t overlap, but they’re probably not very far apart from each other? Honestly I can’t be arsed checking but this is my feeling.↩︎\nand continuously index stochastic processes/random fields in general↩︎\nsee Simon Cotter and Friends↩︎\nsee Geir-Arne Fuglstad and friends↩︎\nZhang, H. (2004). Inconsistent estimation and asymptotically equal interpolations in model-based geostatistics. Journal of the American Statistical Association, 99(465):250–261.↩︎\nEveryone who’s ever suffered through that inexplicable grad-level measure-valued probability course that builds up this really fucking intense mathematical system and then essentially never uses it to do anything interesting should be well aware of the many many many many ways to prove the central limit theorem.↩︎\nwell, the characteristic function when \\(t=1\\) because if \\(\\ell \\in B^*\\), \\(t\\ell \\in B^*\\).↩︎\nIn a locally convex space, this is true as measures over the cylindrical \\(\\sigma\\)-algebra, but for separable spaces it’s true over the Borel \\(\\sigma\\)-algebra (aka all open sets), which is an enormous improvement. (This happens because for separable spaces these two \\(\\sigma\\)-algebras coincide.) That we have to make these sorts of distinctions (between Baire and Borel measures) at all is an important example of when you really need the measure theoretic machinery to do probability theory. Unfortunately, this is beyond the machinery that’s typically covered in that useless fucking grad probability course.↩︎\nIt is not at all clear that the range of this operator is contained in \\(B\\). It should be mapping to \\(B^{**}\\), but that separability really really helps! Check out the Hairer notes.↩︎\nOr they define it on the set \\(\\{\\ell - \\mu(\\ell): \\ell \\in B^*\\}\\), the completion of which is the general definition of \\(R_u\\).↩︎\nRadon-Nikodym derivative↩︎\nA true pain in the arse when working on infinite dimensional spaces is that there’s no natural equivalent of a Lebesgue measure, so we don’t have a universal default measure to take the density against. So we have to take it against an existing probability measure. In this case, the most convenient one is the distribution of \\(u\\). In finite dimensions, the density \\(\\rho(u)\\) would satisfy \\(p_w(x) = \\rho(x)p_u(x)\\) where \\(p_w(\\cdot)\\) is the density of \\(w\\).↩︎\nI’m skipping the actual computation because I’m lazy.↩︎\nor if you’re working on a separable Hilbert space↩︎\nself-adjoint↩︎\nseparable↩︎\nThis next thing is a consequence of Borel’s inequality: \\(\\mathbb{B}(t, H_u)\\) is the \\(t\\) ball in \\(H_u\\) and a \\(A\\) is any measurable subset of \\(B\\) with \\(\\Pr(u \\in A) = \\Phi(\\alpha)\\), then \\(\\Pr(u \\in A + \\mathbb{B}(t, H_u)) \\geq \\Phi(\\alpha + t)\\), where \\(\\Phi\\) is the CDF of the standard normal distribution. Just take \\(t\\rightarrow \\infty\\).↩︎\nAt some point while writing this I’ve started using RKHS and Cameron-Martin space interchangeably for the one that is a subset of \\(B\\). We’re all just gonna have to be ok with that.↩︎\nYou can get references for this from the Bogachev book, but I actually quite like this survey from Jan van Neervaen, even though it’s almost comically general.↩︎\nAlthough I made the big, ugly assumption that \\(B\\) was separable halfway through the last definition, almost everything is true without that. Just with more caveats. Whereas, the abstract Wiener space construction really fundamentally uses the separability of \\(H_u\\) and \\(B\\) as a place to start.↩︎\nie with \\(\\Pr(\\tilde u \\in H) = 1\\)↩︎\nIt has lots of them but everything we’re about to talk about is independent of the choice of orthonormal basis.↩︎\n\\(\\|e_n\\|_H = 1\\) and \\(\\langle e_n, e_m \\rangle = 0\\) for \\(m\\neq n\\).↩︎\nThis is the trace of the operator \\(C_u\\) and I would usually write this as \\(\\sum_{n\\geq 1} \\langle Ce_i, e_i\\rangle\\), but it makes no difference here.↩︎\nThere’s a result called Fernique’s theorem that implies that Gaussian processes have all polynomial and exponential moments.↩︎\nIt’s called an iso-normal process and is strongly related to the idea of white noise and I’ll probably talk about that at some point. But the key thing is it is definitely not a Gaussian process in the ordinary sense on \\(H\\). We typically call it a generalized Gaussian process or a Generalized Gaussian random field and it is a Gaussian process indexed by \\(H\\). Life is pain.↩︎\nYou can convince yourself this is true. I’m not doing all the work for you↩︎\nIf you want more, read Bogachev or that Radonification paper↩︎\nThe best reference I have is this survey↩︎\n",
    "preview": {},
    "last_modified": "2021-11-03T23:36:51+11:00",
    "input_file": "yes-but-what-is-a-gaussian-process-or-once-twice-three-times-a-definition-or-a-descent-into-madness.knit.md"
  },
  {
    "path": "posts/2021-10-15-priors3/",
    "title": "Priors: Fire With Fire (Track 3)",
    "description": "Objective priors? In finite dimensions? A confidence trick? Yes.",
    "author": [],
    "date": "2021-10-16",
    "categories": [],
    "contents": "\nIt is Friday night, I am in lockdown, and I have had a few drinks. So let’s talk about objective priors.\nThe first and most obvious thing is that they are not fucking objective. It is bad/unethical marketing from the 90s that has stuck. I dislike it. I think it’s unethical (and, personally, immoral) to proclaim a statistical method objective in any context, let alone one in which all you did was compute some derivatives and maybe sent something that isn’t going to fucking infinity to infinity. It’s fucking trash and I hate it.\nBut let’s talk about some objective priors.\nWhat is an objective prior\nFuck knows.\nWho uses objective priors\nNo one (see above). But otherwise, a lot of people who are being sold a mislabeled bill of goods. People who tell you, unprompted, that they went to Duke.\nShould I use objective priors\nNo.\nOk let’s try again.\nNo I do not think I will.\nI am willing to talk about finite dimensional priors that add minimal information or are otherwise related to MLEs.\nLater, I guess because I’m mathematically interested in it, I’ll talk about the infinite dimensional case. But not today. Because I’m pissed off.\nAnyway.\nWhat is an objective prior\nHonestly, still a pretty vague and stupid concept. It is difficult to define for interesting (aka not univariate) cases, but maybe the most practical definition is priors that come from rules.\nBut that’s not a … great definition. Many priors that I will talk about over the next little while could probably be shoved under the objective banner. But in this post I’m going to talk about the OG concept of an objective prior: the type of priors that try to add minimal information beyond the data.\nNominally, the aim of these priors is to let the data speak for itself. And I’ve been doing this a while, and no matter how long I’ve listened to my .csv file, it has never said a word. But if it weren’t for silly justifications, we wouldn’t have silly concepts.\nThere are, essentially, three main types of priors that fall into this traditionally objective category:\nJeffreys priors\nReference priors\nMatching priors\nJefferys priors argue, for a bunch of very sensible and solid geometrical reasons, that the value of the parameter \\(\\theta\\) is less important than the way that moving from \\(\\theta\\) to \\(\\theta + d\\theta\\) will change the likelihood \\(p(y \\mid \\theta)\\). This push back against the Arianist notion that the prior can be separated from its context is welcome!\nThe actual prior itself comes from, I guess, the idea that the prior should be invariant to reparameterisations and after some maths you get \\[\np(\\theta ) \\propto |I(\\theta)|^{1/2},\n\\] where \\(|I(\\theta)|\\) is the determinant of the Fisher1 information matrix \\[\nI(\\theta)_{ij} = \\frac{\\partial^2}{\\partial \\theta_i \\theta_j} \\log p(y \\mid \\theta).\n\\]\nThis immediately turns out to be a terrible idea for general models. When \\(\\theta\\) has more than one component, the Jeffreys prior tends to concentrate in silly places in the parameter space.\nBut when \\(\\theta\\) is one dimensional, it works fine. In fact, if you use it you will get the sampling distribution Maximum Likelihood estimator (or withing \\(\\mathcal{O}_p(n^{-1})\\) of it). So there’s very little purpose pursing this line of reasoning.\nThere’s actually a bit of a theme that develops here: for models with a single parameter a lot of things work perfectly. Sadly the intersection of one-dimensional statistical models that are regular enough for all this maths to work and interesting statistical problems is not exactly hefty.\nReference priors are an attempt to extend Jeffreys priors to multiple parameters while avoiding some of the more egregious problems of multivariate Jeffreys priors. They were also the topic of the most boring talk I have ever seen at a conference2. It was 45 minutes going through all of the different reference priors you can make for inferring a bivariate normal (you see, to construct a reference prior you need to order your parameters and this ordering matters). If I didn’t already think that reference priors were an impractical waste of time, that certainly convinced me. A lot of people seem to mention reference priors, but it is rarer to see them in use.\nMatching priors try to spin off Jeffreys priors in a different direction. They are a mathematically very interesting idea asking if there is a prior that will produce a posterior uncertainty interval that is exactly the same as (or very close to) the sampling distribution of the MLE. It turns out that for one parameter models you can totally do this (the Jeffreys prior does it! And you can get even closer). But when there are nuisance parameters (aka parameters that aren’t of direct inferential interest but are important to modelling the data), the resulting prior tends to be data-dependent. A really nice example of the literature is Reid, Mukerjee, and Fraser’s 2003 paper. To some extent the matching priors literature is asking “should we even Bayes?”, which is not the worst question to ask3.\nThese three ideas have a number of weird bastard children. Most of these are not recommended by anyone, but used prominently. These are the vague priors. The \\(N(0,100^2)\\) priors. The \\(\\text{Inverse-Gamma}(\\epsilon, \\epsilon)\\) priors. The Uniform over large interval priors. The misinformed concept behind these priors is that wider prior = less information. This is, of course, bullshit. As many4 many5 many6 examples show.\nThe one big thing that I haven’t mentioned so far is that most of the time the priors produced using these methods are not proper, which is to say that you can’t integrate them. That isn’t a big deal mathematically as long as \\(\\int_\\Theta p(y \\mid \\theta)p(\\theta)\\,d\\theta\\) is finite for all7 data sets \\(y\\). This is a fairly difficult thing to check for most models and if you want to really upset a grad student at a Bayesian conference spend some time staring at their poster and then grimace and ask “are you sure that posterior is proper?”8 The frequent impropriety of these classes of means you can’t simulate from them, can’t really consider them a representation of prior information, and can’t easily transfer them from one problem to another without at least a little bit of fear that the whole house of cards is gonna come tumbling down.\nWho uses objective priors\nFrequentists. People who are obsessed with statistical bias of their estimators (the Venn diagram here isn’t a circle, but it’s also not the poster child for diversity of thought or modernity). People who read boring textbooks. People who write boring textbook. People who believe that it’s the choice of prior and somehow not the choice of the likelihood or, you know, their choice of data that will somehow lead to incorrect inferences9. People who tell you, without being asked10, that they went to Duke.\nShould I use objective priors\nIf you’ve more parameters than a clumsy butcher has fingers on their non-dominant hand, you probably shouldn’t use objective priors. In these cases, you almost always need to inject some form of regularisation, prior information, or just plain hope into your model to make it behave sensibly11.\nBut if you have less, I mean, live your life I guess. But why go to the effort. Just compute a maximum likelihood if you’re looking for something that is very very similar to a maximum likelihood estimate. It’s faster, it’s cleaner, and it’s not pretending to be something it isn’t.\nI actually think you can usually make stronger, more explicitly justified choices using other things we can talk about later. But I’m not the boss of statistics so you don’t have to listen to me.\n\newwwwwww↩︎\nThis is a very high bar. I have seen (and given) a lot of very very very dull talks. But this is the one that sticks in my mind.↩︎\nIf it seems like I like matching priors more than the other two, I do.↩︎\nhttps://projecteuclid.org/journals/bayesian-analysis/volume-1/issue-3/Prior-distributions-for-variance-parameters-in-hierarchical-models-comment-on/10.1214/06-BA117A.full↩︎\nPut a wide normal prior on the logit mean, simulate and back transform. Explain how that is uninformative.↩︎\nSome people love a wide uniform distribution \\(\\text{Unif}(0,U)\\) on the degrees of freedom of a student-t distribution. As \\(U\\) increases, you are putting more and more prior mass on the \\(t\\) distribution being very close to a normal distribution. Oops.↩︎\nor all after some minimal restrictions↩︎\nAllegedly, Jim Berger’s wife, who is not a statistician but was frequently at conferences, used to do this.↩︎\nLike seriously. I don’t want to repeat that old canard that the choice of likelihood is as subjective as the choice of prior because a) Arianism and b) the choice of likelihood is a waaaaaaaaaay more important subjective modelling choice than the choice of prior in all but the most outre circumstances!↩︎\nI promise I have never asked and I will never ask.↩︎\nThere are ideas of objective priors in these cases, which we will talk about later, but these usually take the form of priors that guarantee optimal frequentist behaviour. And again, there is often another way to get that.↩︎\n",
    "preview": {},
    "last_modified": "2021-10-16T21:29:01+11:00",
    "input_file": "priors3.knit.md"
  },
  {
    "path": "posts/2021-10-14-priors2/",
    "title": "Priors: Whole New Way (Track 2)",
    "description": "Conjugate Priors? The crystal deoderant of Bayesian statistics",
    "author": [],
    "date": "2021-10-15",
    "categories": [],
    "contents": "\nIf we’re going to talk about priors, let’s talk about priors. And let’s talk about the most prior-y priors in the whole damn prior universe. Let’s talk about conjugate priors.\nWhat is a conjugate prior?\nWho cares.\nWho uses conjugate priors?\n90s revivalists.\nShould I use conjugate priors?\nLive your life.\nOk. Maybe we should try again\nDeep breaths. You soul is an island of positivity.\nWhat is a conjugate prior?\nConjugate priors are wild and fabulous beasts. They roam the strange, mathematic plains and live forever in our dreams of a better future.\nToo much?\nOK.\nConjugate priors are a mathematical curiosity that occasional turn out to be slightly useful.\nA prior distribution \\(p(\\theta)\\) is conjugate to the likelihood1 \\(p(y \\mid \\theta)\\) if the posterior distribution \\(p(\\theta \\mid y)\\) is in the same distributional family as the prior.\nMoreover, there is an rule to update the parameters in the prior to get the parameters in the posterior based on some simple summaries of the data. This means that you can simply write the posterior down as a specific distribution that you can2 easily sample from and get on with your life.\nReally, it seems like a pretty good thing. But there is, unsurprisingly, a hitch: almost no likelihoods have conjugate priors. And if you happen to have a model with a nice3 conjugate prior then good for you, but if you modify your model even slightly, you will no longer have one.\nThat is, the restriction to conjugate priors is a massive restriction on your entire model.\nWho uses conjugate priors?\nConjugate priors are primarily used by two types of people:\nPeople who need to write exam questions for undergraduate Bayesian statistics courses4,\nPeople who need to implement a Gibbs sampler and don’t want to live through the nightmare5 that is Metropolis-within-Gibbs.\nFor the most part, we can ignore the first group of people as a drain on society.\nThe second group is made up of:\npeople who are using software that forces it on them. And like we don’t all have time to learn new software6. Leave, as hero7 Chris Crocker, Britney alone.\npeople who are writing their own Gibbs sampler. Annie Lennox said it best: Why-y-y-y-y-y-y-y-y-y-y? For a very large variety of problems, you do not have to do this8. The exception is when you have a discrete parameter in your model that you can’t marginalise out9, like an exponential random graph model or something equally hideous. Thankfully, a lot of work in machine learning has expanded the options for Bayesian and pseudo-semi-kinda Bayesian10 estimation of these types of models. Anyway. Discrete parameters are disgusting. I am tremendously indiscrete.\nThe third type are the odd ducks who insist that because the posterior and the prior being in the same family means that the prior can be interpreted as the outcome of Bayesian analysis on a previous experiment. Instead of the much more realistic way of arriving at a conjugate prior where you find yourself waking up alone in a bathtub full of ice and using an \\(\\text{Inverse-Gamma}(1/2, 0.0005)\\) prior on the variance (which is conjugate for a Gaussian likelihood) because some paper from 199511 told you it was a good choice.\nShould I use conjugate priors?\nThere is actually one situation where they can be pretty useful. If your parameter space breaks down into \\(\\theta = (\\eta, \\phi)\\), where \\(\\eta\\) is a high-dimensional variable, then if \\(p(y \\mid \\theta) = p(y \\mid \\eta)\\) and \\(p(\\eta \\mid \\phi)\\) is conjugate for \\(p(y \\mid \\eta)\\), then a magical thing happens: you can compute \\(p(\\eta \\mid y, \\phi)\\) explicitly (using the conjugate property) and then you can greatly simplify the posterior as \\(p(\\theta\\mid y ) = p(\\eta \\mid y, \\phi) p(\\phi \\mid y)\\), where12 \\[\np(\\phi \\mid y) = \\frac{p(y \\mid \\eta)p(\\eta \\mid \\phi)p(\\phi)}{p(y) p(\\eta \\mid y, \\phi)} \\propto \\left.\\frac{p(y \\mid \\eta)p(\\eta \\mid \\phi)p(\\phi)}{p(\\eta \\mid y, \\phi)}\\right|_{\\eta = \\text{anything}},\n\\] where every term on the right hand side is able to be calculated13. Even if this doesn’t have a known distribution form, it is much much lower-dimensional than the original problem and much more amenable to MCMC or possibly deterministic integration methods.\nThis really does feel a bit abstract, so I will give you the one case where I know it’s used very commonly.This is the case where \\(y \\sim N(A\\eta, R)\\) and14 \\(\\eta \\mid \\phi \\sim N(0, \\Sigma(\\phi))\\), where \\(\\Sigma(\\phi)\\) is a covariance matrix and \\(A\\) is a matrix (the dimension of \\(\\eta\\) is often higher than the dimension of \\(y\\)).\nThis is an example of a class of models that occur constantly in statistics: Håvard Rue15 calls them Latent Gaussian models. They basically extend16 (geostatistical)? linear|additive (mixed)? models. So for all of these models, we can explicitly integrate out the high-dimensional Gaussian component, which makes inference a breeze17.\nIt gets slightly better than that because if you combine this observation with a clever asymptotic approximation, you get an approximately conjugate model and can produce Laplace approximations, nested Laplace approximations18, and Integrated Nested Laplace approximations19, depending on how hard you are willing to work.\nA conclusion, such as it is\nYes we have drifted somewhat from the topic, but that’s because the topic is boring.\nConjugate priors are mostly a mathematical curiosity and their role in Bayesian statistics is inexplicably inflated20 to make them seem like a core topic. If you never learn about conjugate priors your Bayesian education will not be lacking anything. It will not meaningfully impact your practice. But even stopped clocks are right 2-3 times a day21\n\nLike all areas of Bayesian statistics, conjugate priors push back against the notion of Arianism.↩︎\noften, but not always↩︎\nChristian Robert’s book The Bayesian Choice has an example where a model has a conjugate prior but it doesn’t normalise easily.↩︎\nOr, in my case, it’s explicitly listed on the syllabus.↩︎\nNot a nightmare.↩︎\nI’m equally likely to learn Julia and Stata. Which is is to say I’m tremendously unlikely to put the effort in to either. I wish them both well. Live your life and let me live mine.↩︎\nI have not fact checked this recently, and we all know white gays sometimes go bad. But he started from a good place, so I’m sure it’s fine.↩︎\nThere is pedagogical value in learning how MCMC methods work by implementing them yourself. But girl it is 2021. Go fuck with a bouncy particle sampler or something. Live your live out loud! Young Bayesians run free↩︎\nOften, like with mixture models or hidden markov models, you can eg https://mc-stan.org/docs/2_22/stan-users-guide/latent-discrete-chapter.html↩︎\nThe difference between these things is pretty slight in the usual situation where your MCMC scheme doesn’t explore the space particularly well. I’m not of the opinion that you either explore the full posterior or you don’t use the model. Most of the time you do perfectly fine with approximate exploration or, at least, you do as well as anything else will.↩︎\nBERNARDINELLI, L., CLAYTON, D. and MONTOMOLI, C. (1995). Bayesian estimates of disease maps: How important are priors? Stat. Med. 14 2411–2431.↩︎\nMultiply both sides of the first equation by the denominator and it’s equivalent to \\(p(y, \\eta, \\phi) = p(y, \\eta, \\phi)\\), which is tautologically true.↩︎\nThe constant of proportionality does not depend on \\(\\eta\\). All of the \\(\\eta\\) parts cancel!↩︎\nThe mean doesn’t have to be zero but you can usually make it zero using … magic.↩︎\nFamous for INLA↩︎\napologies for the regexp.↩︎\nSee also Rasmussen and Williams doing marginal inference with GPs. Exactly the same process.↩︎\nhttps://arxiv.org/abs/2004.12550↩︎\nhttps://www.r-inla.org↩︎\nI assume this is so people don’t need to update their lecture notes.↩︎\ndaylight savings time fades the curtains and wreaks havoc with metaphors.↩︎\n",
    "preview": {},
    "last_modified": "2021-11-03T22:14:09+11:00",
    "input_file": "priors2.knit.md"
  },
  {
    "path": "posts/2021-10-14-priors1/",
    "title": "Priors: Night work (Track 1)",
    "description": "Priors? Defined. Questions? Outlined. Purpose? Declared.",
    "author": [],
    "date": "2021-10-14",
    "categories": [],
    "contents": "\nI have feelings. Too many feelings. And ninety six point seven three percent of them are about prior distributions1. So I am going to write a few blog posts about prior distributions.\nTo be very honest, this is mostly a writing exercise2 to get me out of a slump.\nSo let’s do this.\nNo love, deep web\nAs far as I am concerned it’s really fucking stupid to try to write about priors on their own. They are meaningless outside of their context. But, you know, this is a blog. So I get to be stupid.\nSo what is a prior distribution? It is whatever you want it to be. It is a probability distribution3 that … I don’t know. Exists4.\nOk. This is not going well. Let’s try again.\nA prior distribution is, most of the time, a probability distribution on the parameters of a statistical model. For all practical purposes, we tend to work with its density, so if the parameter \\(\\theta\\), which could be a scalar but, in any interesting case, isn’t, has prior \\(p(\\theta)\\).\nCaptain fantastic and the brown dirt cowboy\nBut what does it all meeeeeeeean?\nWe have a prior distribution specified, gloriously, by it’s density. And unlike destiny, density is meaningless. It only makes sense when we integrate it up to get a probability \\[\n\\Pr(A) = \\int_A p(\\theta)\\,d\\theta.\n\\]\nSo what does the prior probabilty \\(\\Pr(A)\\) of a set \\(A\\) actually mean in real life? The answer may shock you: it means something between nothing and everything.\nScenario 1: Let’s imagine that we were trying to estimate the probability that someone in some relative homogeneous subgroup of customers completed a purchase on our website. It’s a binary process, so the parameter of interest can probably just be the probability that a sale is made. While we don’t know what the probability of a sale is for the subgroup of interest, we know a lot sales on our website in general (in particular, we know that about 3% of visits result in sales). So if I also believe that it would be wildly unlikely for 20% of visits to result in a sale, I could posit a prior like a \\(\\text{Beta}(0.4,5)\\) prior that captures (a version of) these two pieces of information.\n\n\nShow code\n\n  ## Step 1: \n  \nfn <- \\(x) (qbeta(0.5,x[1], x[2]) - 0.02)^2 + \n  (qbeta(0.9, x[1], x[2]) - 0.2)^2\n\nbest <- optim(c(1/2,1/2), fn)\n\n## Step 3: Profit.\n## (AKA round and check)\nqbeta(0.9, 0.4, 5)\nqbeta(0.5, 0.4, 5)\n\n\n\nScenario 2: Let’s imagine I want to do variable selection. I don’t know why. I was just told I want to do variable selection. So I fire up the Bayesian Lasso5 and then threshold in some way. In this case, the prior encode a hoped-for property of my posterior. (To paraphrase Lana, hope is a dangerous thing for a woman like you to have because the Bayeisan Lasso does not work to the point that the original paper doesn’t even suggest using it for variable selection6 it just, idk, liked the name. Statistics is wild.)\nScenario 3: I’m doing a regression with just one variable (because why not) and I think that the relationship between the response \\(y\\) and the covariate \\(x\\) is non-linear. That is, I think there is some unknown to me function \\(f(x)\\) such that \\(\\mathbb{E}(y_i) = f(x_i)\\). So I ask a friend and they tell me to use a Gaussian Process prior for \\(f(\\cdot)\\) with an exponential covariance function.\nWhile I can write down the density for the joint prior of \\((f(x_1), f(x_2,), \\ldots, f(x_n))\\), I do not know7 what this prior means in any substantive sense. But I can tell you, you’re gonna need that maths degree to even try.\nAnd should you look deeper, you will find more and more scenarios where priors are doing different things for different reasons8. For each of these priors in each of these scenarios, we will be able to compute the posterior (or a reasonable computational approximation to it) and then work with that posterior to answer our questions.\nDifferent people9 will use priors different ways even for very similar problems10. This remains true even though they are nominally working under the same inferential framework.\nBayesians are chaotic.\nMapping out a sky / What you feel like, planning a sky\nSondheim’s ode to pointillism feels relevant here. The reality of the prior distribution—and the whole reason the concept is so slippery and chaotic—is that you are, dot by dot, constructing the world of your inference. This act of construction is fundamental to understanding how Bayesian methods work, how to justify your choices, and how to use a Bayesian workflow to solve complex problems.\nTo torture the metaphor, our prior distribution is just our paint, unmixed, slowly congealing, possibly made of ground up mummys. It is nothing without a painter and a brush.\nThe painter is the likelihood or, more generally, the generative link between the parameter values and the actual data, \\(p(y \\mid \\theta)\\). The brush is the computational engine you use to actually produce the posterior painting11.\nThis then speaks to the core challenge with writing about priors: it depends on how you use them. It is a fallacy, or perhaps a foolishness, or perhaps a heresy12. Hell, when trying to understand a single inference The Prior Can Only Be Understood In The Context Of The Likelihood13. In the context of an entire workflow, The Experiment is just as Important as the Likelihood in Understanding the Prior.\nFor instance, using independent Cauchy priors for the coefficients in a linear regression model will result in a perfectly ok posterior. Whereas the same priors used in a logistic regression, you may end up with posteriors with such heavy tails that they don’t have a mean! (Do we care? Well, yes. If we want reasonable uncertainty intervals we probably want 2 or so moments otherwise those large deviations are gonna getcha!)\nSo what?\nAll of this is fascinating. And it is a lot less chaotic than it initially sounds.\nThe reality is that while two Bayesians may use different priors and, hence, produce different posteriors for the same data set.This can be extreme. For example, if I am trying to estimate the mean of data generated by \\(y_i \\sim N(\\mu, 1)\\), then I can choose a prior14 (that depends on the data) so that the posterior mean \\(\\mathbb{E}(\\mu \\mid y) =1\\). Or, to put it differently, I can get any answer I want if I choose an prior carefully (and in a data-dependent manner).\nBut this isn’t necessarily a problem. This is because the posteriors produced by two sensible priors for the same problem will produce fairly similar results15. The prior I used to cheat in the previous example would not be considered sensible by anyone looking at it16.\nBut what is a sensible prior? Can you tell if a prior is sensible or not in its particular context? Well honey, how long have you got. The thing about starting a (potential) series of blog posts is that I don’t really know how far I’m going to get, but I would really like to talk a lot about that over the next little while.\n\nThe rest are about the night I saw Patti LuPone trying to get through the big final scene in War Paint as part of her costume loudly disintegrated.↩︎\nI’m told it’s useful to warm up sometimes because this pandemic has me ice cold.↩︎\nSometimes.↩︎\nExcept, and I cannot stress this enough, when it doesn’t.↩︎\nPlease do not do this!↩︎\nExcept for once in the abstract in a sentence that is in no way shape or formed backed up in the text. Park and Casella (2008)↩︎\nI do know. I know a very large amount about Gaussian processes. But lord in heaven I have seen the greatest minds of my generation subtly fuck up the interpretation of GP priors. Because it’s increadibly hard. Maybe I’ll blog about it one day. Because this is in markdown so I can haz equations.↩︎\nSome reasons are excellent. Some, like the poor Bayesian Lasso, are simply misguided.↩︎\nor the same person in different contexts↩︎\nAre any two statistical problems ever the same?↩︎\nYes. I have a lot of feelings about this too, but meh. A good artist can make great art with minimal equipment (see When Doves Cry), but most people are not the genius Prince was so just use good tools and stress less!↩︎\nI have written extensively about priors in the context of the Arianist heresy because of course I fucking have. Part 1, Part 2, Part 3. Apologies for mathematics eaten by a recent formatting change!↩︎\nEditors forced the word often into the published title and, like, who’s going to fight?↩︎\n\\(N(2-\\bar{y},n^{-1})\\)↩︎\nWhat does this even mean? Depends on your context really. But a working definition is that the big picture features of the posterior are similar enough that if you were to use it to make a decision, that decision doesn’t change very much.↩︎\nBut omg subtle high dimensional stuff and I guess I’ll talk about that later maybe too?↩︎\n",
    "preview": {},
    "last_modified": "2021-10-16T21:29:51+11:00",
    "input_file": "priors1.knit.md"
  },
  {
    "path": "posts/2021-10-11-n-sane-in-the-membrane/",
    "title": "$(n-1)$-sane in the membrane",
    "description": "Windmills? Tilted. Topic? Boring. (n-1)? No.",
    "author": [
      {
        "name": "Dan Simpson",
        "url": "https://dpsimpson.github.io"
      }
    ],
    "date": "2021-10-14",
    "categories": [],
    "contents": "\nI’ve been teaching a lot lately. That’s no huge surprise. It is my job. Maybe the one slight oddity this year is that I shifted jobs and, in switching hemispheres, I landed 3 consecutive teaching semesters. So. I’ve been teaching a lot lately.\nAnd when you’re in a period of heavy teaching, every-fucking-thing is about teaching.\nSo this blogpost is about teaching.\nRight now, I’m coming to the end of a second year class called Statistical Thinking. It’s been fun to work out how to teach the material. It’s standard fare: sampling variation, tests, bootstraps1, regression, and just a hint of Bayes in the last 2 weeks that you incentivize by promising a bastard of an exam question. So you know, (arms up even though I’m Catholic) tradition!\nIf I were a rich man (Katrina Lenk with a violin)\nThe thing about teaching an intro stats class is that it brings screaming to mind that quote from Bennett’s The History Boys2: (paraphrasing) “How do I define [intro to Statistics]? It’s just one fucking thing after another”.\nConstructing twelve moderately sequential weeks from the whole mass of things that someone being introduced to statistics needs to know is not unlike being thrown in the middle of the lake with nothing but an ice-cream container and a desiccated whale penis: confusing, difficult, and rather damp.\nThe nice thing about building an intro stats course is you’re not alone. You’re adrift in a sea of shit ideas! (Also a lot of good ones3, but don’t ruin my flow!)\nThe trouble is that this sort of course is simultaneously teaching big concepts and complex details. And while it’s not toooooo hard to make the concepts build and reinforce as time inexorably marches on, the techniques and details needed to illuminate the big concepts are not quite as linear.\nThere are two routes through this conundrum: incantations inscribed onto books made of human skin using the blood of sacrificial virgins (aka gathered during engineering statistics service teaching) or computers.\nI went with computers because we are in lockdown and I couldn’t be bothered sourcing and bleeding virgins.\nThe downside is that you need the students to have a grip on R programming (and programmatic thinking). This only happens if the degree you are teaching in is built in such a way that these skills have already been taught. Otherwise you need to teach both (which is very possible, but you need to teach less statistical content).\nThis is not a postmortem on my teaching, but if it were, it would be about that last point.\nI saw Goody Proctor with the devil!\nA tweet from Sanjay SrivastavaThis is a very long way to say I saw a tweet an had feelings.\nBecause I’m thinking about this stuff pretty hard right now, I am (as Hedwig would say) fully dilated.\nAnd my question is what is the use of teaching this distinction? Should anyone bother dividing by \\((n-1)\\) instead of \\(n\\) in their variance estimates?\nWell I guess the first question is is there a difference in this distinction? Let’s do the sort of R experiment I want my students to do!\n\n\n# Independent samples for a qq-plot!\n# Thanks to Rob Trangucci for catching this!\nlibrary(tidyverse)\nn_sim <- 100000\nn <- 10\nexperiments <- tibble(exp = rep(1:n_sim, each = n),\n                      sample = rnorm(n * n_sim),\n                      sample2 = rnorm(n * n_sim))\n\ncompare <- experiments %>%\n  group_by(exp) %>%\n  summarise(m = mean(sample),\n            m2 = mean(sample2),\n            var_bias = mean((sample - m)^2),\n            z_bias = m / sqrt(mean(var_bias)),\n            z = m2 / sd(sample2))\n\n\ncompare %>% \n  ggplot(aes(sort(z), sort(z_bias))) +\n  geom_point() +\n  geom_abline(slope = 1, intercept = 0) +\n  theme_bw() + \n  coord_fixed(xlim = c(-2,2), y = c(-2,2))\n\n\n\n\nWell that is clear. There is not.\nOr, well, there is a small difference.\nBut to see it, you need a lot of samples! Why? Well the easy answer is maths.\nFor one thing, when \\(n=10\\), \\[\n\\frac{1}{n} - \\frac{1}{n-1} = \\frac{1}{90} = 0.01.\n\\] This does not compare well against the sampling variance, which (assuming \\(\\sigma^2\\approx 1\\), which is usual if you’ve scaled your problem correctly) is about \\(0.3\\).\nBut we could choose to do it properly. The bias in the MLE (aka the divide by \\(n\\)) variance estimate is \\[\n-\\frac{\\sigma^2}{n}.\n\\] This is a lot smaller than the sampling variability of the estimate (aka how much uncertainty you have because of the finite sample), which is \\[\n\\frac{\\sigma}{\\sqrt{n}}.\n\\]\nAnd that’s the whole story. Dividing by \\(n\\) instead of \\((n-1)\\) leaves you with a slightly biased estimate. But the bias if fucking tiny. It is possibly moving your second decimal place by about 1 number (assume our population variance is one). The sampling variably is moving the first decimal place by several digits.\nTruly. What is the point. The old guys4 who went wild about bias are now mostly dead. Or they’ve changed their minds (which is, you know, a reasonable thing to do as information about best practice is updated). The war against bias was lost before your undergraduates were born.\nEven in crisis, I maintain\nBut nevertheless, this whole DIVIDE BY N-1 OR THE BIAS MONSTER IS GONNA GET YA bullshit continues.\nAnd to some extent, maybe I shouldn’t care. I definitely shouldn’t care this many words about it.\nBut I do. And I do for a couple of reasons.\nReason One: What is the point teaching students about uncertainty and that you can’t just say “this number is different” because the estimate on a single sample is different. If I am to say that I need things to be at least5 \\(\\mathcal{O}(n^{-1/2})\\) apart before I’m willing to say they are maybe different, then why am I harping on about the much smaller difference?\nReason Two: It’s a shitty example. Bias and bias corrections have a role to play in statistics6. But if this is your first introduction to bias correction, you are going to teach either:\nBias is always bad, regardless of context / sampling variance / etc\nBias can be corrected, but it’s trivial and small.\nBoth of those things are bullshit. Just teach them how to bootstrap and teach the damn thing properly. You do not have to go very far to show bias actually making a difference!\nMaybe the only place the difference will be noticed is if you compare against the in-build var or sd functions. This is not the use case I would build my class around, but it is a thing you would need to be aware of.\nThe worlds is a question, this room is an answer. And the answer is no.\nIf you are going to teach statistics as more than just stale incantations and over-done fear-mongering, you need to construct the types of stakes that are simply not present in the \\(n\\) vs \\(n-1\\) bullshit.\nIt is present when you are teaching the normal vs t distribution. You are teaching that the design of your experiment changes the possible extreme behaviour and sometimes it can change a lot.\nThe \\(n\\) vs \\((n-1)\\) denominator for a variance estimator is a curiosity. It is the source of thrilling7 exercises or exam questions. But it is not interesting.\nIt could maybe set up the idea that MLEs are not unbiased. But even then, the useless correction term is not needed. Just let it be slightly biased and move on with your life.\nBecause if that is the biggest bias in your analysis, you are truly blessed.\nIn real life, bias is the price you pay for being good at statistics. And like any market, if you pay too much you’re maybe not that good. But if you pay nothing at all, you don’t get to play.\n\nTo paraphrase Jimmy Somerville, tell me whyyyyyyyyy about 90% of the bootstrap material on the web is … misguided. And why tidymodels only has the shit bootstrap in it?↩︎\nOk. Straight up, “[Intro to statistics] is a commentary on the various and continuing incapabilities of men” would’ve also worked.↩︎\nThis course stands on the shoulders of giants: Di Cook and Catherine Forbes gave me a great base. And of course every single textbook (shout out to the OpenIntro crew!), blog post, weird subsection of some other book, paper from 1987 on some weird bootstrap, etc that I have used to make a course!↩︎\nYes. I used the word on purpose.↩︎\n\\(n\\) is the size of the sample.↩︎\nI spend most of my time doing Bayes shit, and we play this game somewhat differently. But the gist is the same.↩︎\nNot thrilling.↩︎\n",
    "preview": "posts/2021-10-11-n-sane-in-the-membrane/n-sane-in-the-membrane_files/figure-html5/unnamed-chunk-1-1.png",
    "last_modified": "2021-10-14T23:58:13+11:00",
    "input_file": "n-sane-in-the-membrane.knit.md"
  }
]
